# Titanic : Decision tree model

Content:

1.Import the libraries

2.loading the dataset

3.Data cleaning

In [55]:
import pandas as pd

In [56]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [180]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [218]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})# convert to male as 1 & female as 2

In [219]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [220]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [221]:
inputs.head()

   Pclass  Sex   Age     Fare  sex_n  Age_n
0       3  NaN  22.0   7.2500      0     28
1       1  NaN  38.0  71.2833      1     52
2       3  NaN  26.0   7.9250      1     34
3       1  NaN  35.0  53.1000      1     48
4       3  NaN  35.0   8.0500      0     48

In [222]:
#Encoding the label data to numbers

inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [223]:
from sklearn.preprocessing import LabelEncoder
le_Sex = LabelEncoder()
le_Age = LabelEncoder()

In [224]:
inputs['sex_n'] = le_Sex.fit_transform(inputs['Sex'])
inputs['Age_n'] = le_Age.fit_transform(inputs['Age'])

In [225]:
inputs

     Pclass  Sex        Age     Fare  sex_n  Age_n
0         3    1  22.000000   7.2500      0     28
1         1    2  38.000000  71.2833      1     52
2         3    2  26.000000   7.9250      1     34
3         1    2  35.000000  53.1000      1     48
4         3    1  35.000000   8.0500      0     48
..      ...  ...        ...      ...    ...    ...
886       2    1  27.000000  13.0000      0     35
887       1    2  19.000000  30.0000      1     24
888       3    2  29.699118  23.4500      1     39
889       1    1  26.000000  30.0000      0     34
890       3    1  32.000000   7.7500      0     43

[891 rows x 6 columns]

In [226]:
inputs_n = inputs.drop(['Sex','Age'],axis='columns')

In [227]:
inputs_n

     Pclass     Fare  sex_n  Age_n
0         3   7.2500      0     28
1         1  71.2833      1     52
2         3   7.9250      1     34
3         1  53.1000      1     48
4         3   8.0500      0     48
..      ...      ...    ...    ...
886       2  13.0000      0     35
887       1  30.0000      1     24
888       3  23.4500      1     39
889       1  30.0000      0     34
890       3   7.7500      0     43

[891 rows x 4 columns]

In [228]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [229]:
#datasplitting

from sklearn.model_selection import train_test_split

In [230]:
X_train, X_test, y_train, y_test = train_test_split(inputs_n,target,test_size=0.2)

In [231]:
len(X_train)

712

In [232]:
len(X_test)

179

In [213]:
#Train the model using decision tree

from sklearn import tree
model = tree.DecisionTreeClassifier()

In [214]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [215]:
model.score(X_test,y_test)

0.7821229050279329

In [ ]:
#Evaluating parameters